[
  {
    "title": "Bonfire - No/Low-Code 3D Platform (Dimension X)",
    "image": "img/Bonfire-steam-page-1_crop.jpg",
    "video": null,
    "primaryTags": ["Unity", "C#", "UI/UX"],
    "secondaryTags": ["3D", "VR", "Steam", "Oculus", "AWS", "Multiplayer", "Cesium", "Design"],
    "description": "As a Senior Unity Engineer and Team Lead, I'm contributing to the upcoming release of Bonfire with the Dimension X team. I also lead projects on Digital Twins and VR for education, using my breadth of experience to tackle real-world challenges.",
    "projectUrl": "https://store.steampowered.com/app/3113160/Bonfire/",
    "projectUrlText": "View on Steam"
  },
  {
    "title": "CoreSpec3D - Layers System (Dimension X)",
    "image": "img/CoreSpec3D_UI-visuals.jpg",
    "video": "",
    "primaryTags": ["Unity", "C#", "DOTS (C# Job System)", "UI/UX", "UI Toolkit", "Lighting"],
    "secondaryTags": ["Mobile", "Design (Iconography)"],
    "description": "As a Senior Unity Engineer and UI/UX Designer, I upgraded CoreSpec3D from Unity 2022.3 to Unity 6, incorporating performance enhancements and rendering upgrades for both desktop and mobile platforms. I also designed the in-app Layers management UI, creating an efficient interface for organizing scene entities like walls, windows, and doors. My focus on visual clarity and usability enhanced the overall user experience while maintaining real-time performance across platforms.",
    "projectUrl": "",
    "projectUrlText": ""
  },
  {
    "title": "CADEsport - Character Customization (CADEsport)",
    "image": "img/CADEsport_UMA-avatar-UI.jpg",
    "video": null,
    "primaryTags": ["Unity", "C#", "3D Characters", "UMA", "UI/UX (Procedural)"],
    "secondaryTags": ["Multiplayer", "Physics (Ragdoll)"],
    "description": "As a Senior Unity Developer, I led the creation of a customizable player avatar system that allowed users to personalize their in-game representation. I designed and implemented this feature to enhance player identity and immersion, focusing on clean, scalable code and seamless integration with the game's systems.",
    "projectUrl": "",
    "projectUrlText": ""
  },
  {
    "title": "Viglo Live - Gamified Foreign Language App (Viglo)",
    "image": null,
    "video": "videos/Viglo_intro.mp4",
    "primaryTags": ["Unity", "C#", "Realtime Video", "Multiplayer", "AWS", "LiveOps"],
    "secondaryTags": ["PlayFab", "UI/UX", "Android", "iOS", "Design"],
    "description": "As a Senior Developer and System Architect for Viglo Live, I helped create a gamified language-learning platform that integrates real-time video and multiplayer interactions with immersive learning. I led a cross-disciplinary team where my work involved rapid prototyping, networked game architecture, and managing cloud-based LiveOps. I also developed a cloud-driven DLC pipeline and facilitated continuous build deployment.",
    "projectUrl": "",
    "projectUrlText": ""
  },
  {
    "title": "Zenva Academy - Course QA (Zenva)",
    "image": null,
    "video": "videos/Zenva_intro.mp4",
    "primaryTags": ["Unity", "C#"],
    "secondaryTags": ["Unreal Engine", "C++", "JavaScript", "HTML5"],
    "description": "Providing quality assurance and student course support for Unity, Unreal Engine, Phaser (HTML5), and C++ game development curriculum.",
    "projectUrl": "https://academy.zenva.com/",
    "projectUrlText": "Zenva Academy"
  },
  {
    "title": "CurioXR - VR Education (Dimension X)",
    "image": "img/CurioXR_hands.jpg",
    "video": null,
    "primaryTags": ["Unity", "C#", "VR", "Oculus", "Meta"],
    "secondaryTags": ["Multiplayer"],
    "description": "As a Senior Unity Developer, I helped create an immersive educational experience that combines VR with interactive learning. I developed multiplayer XR features, including an interactive skeletal system and an AI-powered avatar that responds to user questions. I also created custom UI and implemented controller-free navigation, ensuring smooth performance for a global student audience.",
    "projectUrl": "https://www.meta.com/experiences/curio-xr/6297642716922627/",
    "projectUrlText": "View on Meta"
  },
  {
    "title": "Metasphere - Openworld Sandbox (IOTAplus)",
    "image": null,
    "video": "videos/Metasphere_Cinematic-Teaser-01.mp4",
    "primaryTags": ["Unity", "C#", "Web3"],
    "secondaryTags": ["UI/UX", "Build Pipeline", "Asset Mgmt", "Design", "Space Graphics Toolkit"],
    "description": "As Senior Developer, System Architect, Team Lead, and Designer on Metasphere, I led the creation of a unique online world blending social interaction, gameplay, and user-generated content with NFT integration. Players could explore diverse environments, connect with friends, and showcase digital collectibles in personalized 3D galleries. My role combined deep technical architecture with creative vision to bring this ambitious concept to life and lay the foundation for future community-driven evolution.",
    "projectUrl": "",
    "projectUrlText": ""
  }
]